app/controllers/purchases_controller.rb

INSERT INTO "purchases" ("zip", "created_at", "updated_at", "buy", "why", "email") VALUES(12345, '2010-03-17 14:25:30', '2010-03-17 14:25:30', 't', 'why won''t you work?', 'bobo@list.org')
---
  def create
    @purchase = Purchase.new(params[:purchase])

    respond_to do |format|
      if @purchase.save